# Leçon SQL 13: Insertion de lignes

Nous avons passé pas mal de leçons sur la façon d'interroger des données dans une base de données, il est donc temps de commencer à en apprendre un peu plus sur les schémas SQL et comment ajouter de nouvelles données.

## Qu'est-ce qu'un schéma?

Nous avons précédemment décrit une table dans une base de données comme un ensemble bidimensionnel de lignes et de colonnes, les colonnes étant les propriétés et les lignes étant des instances de l'entité dans la table. En SQL, le * schéma de base de données * décrit la structure de chaque table et les types de données que chaque colonne de la table peut contenir.

Exemple: sous-requête corrélée 

Par exemple, dans notre table **Movies**, les valeurs de la colonne *Year* doivent être un nombre entier et les valeurs de la colonne *Title* doivent être une chaîne.

Cette structure fixe permet à une base de données d'être efficace et cohérente malgré le stockage de millions, voire de milliards de lignes.

## Insérer de nouvelles données

Lors de l'insertion de données dans une base de données, nous devons utiliser une instruction **INSERT**, qui déclare dans quelle table écrire, les colonnes de données que nous remplissons et une ou plusieurs lignes de données à insérer. En général, chaque ligne de données que vous insérez doit contenir des valeurs pour chaque colonne correspondante dans le tableau. Vous pouvez insérer plusieurs lignes à la fois en les listant simplement de manière séquentielle.

Insérer une instruction avec des valeurs pour toutes les colonnes
``` mysql 
INSERT INTO mytable
VALUES (value_or_expr, another_value_or_expr, …),
       (value_or_expr_2, another_value_or_expr_2, …),
       …;
```

Dans certains cas, si vous avez des données incomplètes et que la table contient des colonnes prenant en charge les valeurs par défaut, vous pouvez insérer des lignes avec uniquement les colonnes de données dont vous disposez en les spécifiant explicitement.

Insérer une instruction avec des colonnes spécifiques
``` mysql 
INSERT INTO mytable
(column, another_column, …)
VALUES (value_or_expr, another_value_or_expr, …),
      (value_or_expr_2, another_value_or_expr_2, …),
      …;
```

Dans ces cas, le nombre de valeurs doit correspondre au nombre de colonnes spécifié. Bien que ce soit une déclaration plus verbeuse à écrire, l'insertion de valeurs de cette façon a l'avantage d'être compatible avec les versions ultérieures. Par exemple, si vous ajoutez une nouvelle colonne à la table avec une valeur par défaut, aucune instruction **INSERT** codée en dur n'aura à changer en conséquence pour s'adapter à cette modification.

En outre, vous pouvez utiliser des expressions mathématiques et chaîne avec les valeurs que vous insérez.
Cela peut être utile pour garantir que toutes les données insérées sont formatées d'une certaine manière.

Exemple d'instruction d'insertion avec des expressions
``` mysql 
INSERT INTO boxoffice
(movie_id, rating, sales_in_millions)
VALUES (1, 9.9, 283742034 / 1000000);
```

## Exercice

Dans cet exercice, nous allons jouer le rôle de directeur de studio et ajouter quelques films aux **Movies** de notre portfolio. Dans ce tableau, le ** Id ** est un entier à incrémentation automatique, vous pouvez donc essayer d'insérer une ligne avec uniquement les autres colonnes définies.

Étant donné que les leçons suivantes modifieront la base de données, vous devrez exécuter manuellement chaque requête une fois qu'elle sera prête à fonctionner.

**IMPORTANT : Afin de répondre aux questions de l'exercise d'insérer la requête entre les doubles quotes " "**

In [1]:
import pandas as pd

def to_df(s):
    l= [elt.split(';') for elt in s.replace("	", ";").split('\n')]
    return pd.DataFrame(l[1:], columns=l[0])

In [2]:
from pandasql import sqldf

In [3]:
x="""Id	Title	Director	Year	Length_minutes
1	Toy Story	John Lasseter	1995	81
2	A Bug's Life	John Lasseter	1998	95
3	Toy Story 2	John Lasseter	1999	93
4	Monsters, Inc.	Pete Docter	2001	92
5	Finding Nemo	Andrew Stanton	2003	107
6	The Incredibles	Brad Bird	2004	116
7	Cars	John Lasseter	2006	117
8	Ratatouille	Brad Bird	2007	115
9	WALL-E	Andrew Stanton	2008	104
10	Up	Pete Docter	2009	101
11	Toy Story 3	Lee Unkrich	2010	103
12	Cars 2	John Lasseter	2011	120
13	Brave	Brenda Chapman	2012	102
14	Monsters University	Dan Scanlon	2013	110"""
Movies = to_df(x)

In [4]:
Movies

    Id                Title        Director  Year Length_minutes
0    1            Toy Story   John Lasseter  1995             81
1    2         A Bug's Life   John Lasseter  1998             95
2    3          Toy Story 2   John Lasseter  1999             93
3    4       Monsters, Inc.     Pete Docter  2001             92
4    5         Finding Nemo  Andrew Stanton  2003            107
5    6      The Incredibles       Brad Bird  2004            116
6    7                 Cars   John Lasseter  2006            117
7    8          Ratatouille       Brad Bird  2007            115
8    9               WALL-E  Andrew Stanton  2008            104
9   10                   Up     Pete Docter  2009            101
10  11          Toy Story 3     Lee Unkrich  2010            103
11  12               Cars 2   John Lasseter  2011            120
12  13                Brave  Brenda Chapman  2012            102
13  14  Monsters University     Dan Scanlon  2013            110

In [5]:
y="""Movie_id	Rating	Domestic_sales	International_sales
5	8.2	380843261	555900000
14	7.4	268492764	475066843
8	8	206445654	417277164
12	6.4	191452396	368400000
3	7.9	245852179	239163000
6	8	261441092	370001000
9	8.5	223808164	297503696
11	8.4	415004880	648167031
1	8.3	191796233	170162503
7	7.2	244082982	217900167
10	8.3	293004164	438338580
4	8.1	289916256	272900000
2	7.2	162798565	200600000
13	7.2	237283207	301700000"""

In [6]:
BoxOffice = to_df(y)

In [7]:
BoxOffice

   Movie_id Rating Domestic_sales International_sales
0         5    8.2      380843261           555900000
1        14    7.4      268492764           475066843
2         8      8      206445654           417277164
3        12    6.4      191452396           368400000
4         3    7.9      245852179           239163000
5         6      8      261441092           370001000
6         9    8.5      223808164           297503696
7        11    8.4      415004880           648167031
8         1    8.3      191796233           170162503
9         7    7.2      244082982           217900167
10       10    8.3      293004164           438338580
11        4    8.1      289916256           272900000
12        2    7.2      162798565           200600000
13       13    7.2      237283207           301700000

1. Ajoutez la nouvelle production du studio, Toy Story 4 à la liste des films (vous pouvez utiliser n'importe quel réalisateur)

In [16]:
QUERY1 = ""

In [17]:
sqldf(QUERY1)

    Id                Title        Director  Year Length_minutes
0    1            Toy Story   John Lasseter  1995             81
1    2         A Bug's Life   John Lasseter  1998             95
2    3          Toy Story 2   John Lasseter  1999             93
3    4       Monsters, Inc.     Pete Docter  2001             92
4    5         Finding Nemo  Andrew Stanton  2003            107
5    6      The Incredibles       Brad Bird  2004            116
6    7                 Cars   John Lasseter  2006            117
7    8          Ratatouille       Brad Bird  2007            115
8    9               WALL-E  Andrew Stanton  2008            104
9   10                   Up     Pete Docter  2009            101
10  11          Toy Story 3     Lee Unkrich  2010            103
11  12               Cars 2   John Lasseter  2011            120
12  13                Brave  Brenda Chapman  2012            102
13  14  Monsters University     Dan Scanlon  2013            110

2. Toy Story 4 a été acclamé par la critique! Il avait une cote de 8,7 et gagnait 340 millions au pays et 270 millions à l'étranger . Ajoutez l'enregistrement à la table BoxOffice.

In [16]:
QUERY2 = ""

In [17]:
sqldf(QUERY2)

    Id                Title        Director  Year Length_minutes
0    1            Toy Story   John Lasseter  1995             81
1    2         A Bug's Life   John Lasseter  1998             95
2    3          Toy Story 2   John Lasseter  1999             93
3    4       Monsters, Inc.     Pete Docter  2001             92
4    5         Finding Nemo  Andrew Stanton  2003            107
5    6      The Incredibles       Brad Bird  2004            116
6    7                 Cars   John Lasseter  2006            117
7    8          Ratatouille       Brad Bird  2007            115
8    9               WALL-E  Andrew Stanton  2008            104
9   10                   Up     Pete Docter  2009            101
10  11          Toy Story 3     Lee Unkrich  2010            103
11  12               Cars 2   John Lasseter  2011            120
12  13                Brave  Brenda Chapman  2012            102
13  14  Monsters University     Dan Scanlon  2013            110